{
  "publications": [
    {
      "Title": "Developing a method for creating structured representations of working of systems from natural language descriptions using the SAPPhIRE model of causality",
      "Author": "K Bhattacharya, A Majumder, AN Bhatt, <strong>S Keshwani</strong>, BSC Ranjan, A Chakrabarti",
      "Journal": "AI EDAM, 38, e24",
      "Year": 2024,
      "Cited_by": "",
      "Link": "https://doi.org/10.1017/S0890060424000118",
      "DOI": "10.1017/S0890060424000118",
      "Abstract": "Due to their significant role in creative design ideation, databases of causal ontology-based models for biological and technical systems have been developed. However, creating structured database entries through system models using a causal ontology requires the time and effort of experts. Researchers have worked toward developing methods that can automatically generate representations of systems from documents using causal ontologies by leveraging machine learning (ML) techniques. However, these methods use limited, hand-annotated data for building the ML models and have manual touchpoints that are not documented. While opportunities exist to improve the accuracy of these ML models, more importantly, it is required to understand the complete process of generating structured representations using causal ontology. This research proposes a new method and a set of rules to extract information relevant to the constructs of the SAPPhIRE model of causality from descriptions of technical systems in natural language and report the performance of this process. This process aims to understand the information in the context of the entire description. The method starts by identifying the system interactions involving material, energy and information and then builds the causal description of each system interaction using the SAPPhIRE ontology. This method was developed iteratively, verifying the improvements through user trials in every cycle. The user trials of this new method and rules with specialists and novice users of the SAPPhIRE modeling showed that the method helps in accurately and consistently extracting the information relevant to the constructs of the SAPPhIRE model from a given natural language description.",
      "APA": "Bhattacharya, K., Majumder, A., Bhatt, A. N., Keshwani, S., Ranjan, B. S. C., & Chakrabarti, A. (2024). Developing a method for creating structured representations of working of systems from natural language descriptions using the SAPPhIRE model of causality. <em>Artificial Intelligence for Engineering Design, Analysis and Manufacturing</em>, 38, e24. https://doi.org/10.1017/S0890060424000118"
    },
    {
      "Title": "Comparing Analogy-Based Methods—Bio-Inspiration and Engineering-Domain Inspiration for Domain Selection and Novelty",
      "Author": "<strong>S Keshwani</strong>, H Casakin",
      "Journal": "Biomimetics 9 (6), 344",
      "Year": 2024,
      "Cited_by": "2",
      "Link": "https://doi.org/10.3390/biomimetics9060344",
      "DOI": "10.3390/biomimetics9060344",
      "Abstract": "This study aims to support designers in developing transformative solutions in the engineering discipline using the Design-by-Analogy ideation method. Design-by-Analogy involves drawing inspiration from the source domain and applying it to the target domain. Based on the conceptual distance between the two domains, analogies are classified as biological—(natural), cross—(distant-engineering), and within—(near-engineering) domain analogies. Real-world scenarios involve designers selecting analogies after seeking them across multiple domains. These selected analogies significantly influence the produced designs. However, the selection criteria of the analogy domain are unexplored in design research. We address this gap by investigating: (a) the influence of analogy domains on their selection frequency; and (b) the relationship between the frequency of selecting analogies from specific domains and the novelty of designs. The experiment involved twenty-six teams of novice product designers, who solved design problems aided by one analogical source from each domain. The results showed that biological analogies were frequently selected. While biological-domain analogies significantly increased the novelty of designs compared to the within-domain ones; no significant difference was found between the biological- and cross-domain analogies, suggesting that middle-domain analogies can be as effective as far-domain ones. The findings can support technological innovation by aiding the development of analogy search databases.",
      "APA": "Keshwani, S., & Casakin, H. (2024). Comparing analogy-based methods—Bio-inspiration and engineering-domain inspiration for domain selection and novelty. <em>Biomimetics</em>, 9(6), 344. https://doi.org/10.3390/biomimetics9060344"
    },
    {
      "Title": "Influence of analogical domains and comprehensiveness in explanation of analogy on the novelty of designs",
      "Author": "<strong>S Keshwani</strong>, A Chakrabarti",
      "Journal": "Research in Engineering Design 28 (3), 381-410",
      "Year": 2017,
      "Cited_by": "18",
      "Link": "https://doi.org/10.1007/s00163-016-0246-z",
      "DOI": "10.1007/s00163-016-0246-z",
      "Abstract": "The overall goal of this work is to support creativity of technical products by supporting improvement of novelty of designs at the conceptual stage. In this work, use of analogy as a means of aiding creativity was studied for its influence on novelty—a central aspect of creativity. To study their influence on novelty of designs, analogies were classified on the basis of two distinct but related parameters—‘distance between the source and the target domain’ and ‘level of comprehensiveness in explanation of analogues.’ ‘Distance between the source and the target domain’ is defined here as the conceptual closeness between these two domains, on the basis of which analogies are classified as biological domain, cross-domain or in-domain analogies. ‘Level of comprehensiveness in explanation of an analogy’ is defined here as the relative depth at which an analogue is explained, on the basis of which explanation of an analogue is classified as surface, shallow (both shallow and surface are less comprehensive) or deep (more comprehensive). Five design studies have been conducted in laboratory settings to study the influence of these parameters on novelty. The major findings from the study were the following: analogies from the biological domain produced significantly greater novelty in designs over analogies from cross- and in-domain for less comprehensive explanations; analogies from cross-domain and biological domains had no significant difference in novelty in designs for more comprehensive explanations.",
      "APA": "Keshwani, S., & Chakrabarti, A. (2017). Influence of analogical domains and comprehensiveness in explanation of analogy on the novelty of designs. <em>Research in Engineering Design</em>, 28(3), 381–410. https://doi.org/10.1007/s00163-016-0246-z"
    },
    {
      "Title": "Comparing novelty of designs from biological-inspiration with those from brainstorming",
      "Author": "<strong>S Keshwani</strong>, TA Lenau, S Ahmed-Kristensen, A Chakrabarti",
      "Journal": "Journal of Engineering Design 28 (10-12), 654-680",
      "Cited_by": "54",
      "Year": 2017,
      "Link": "https://doi.org/10.1080/09544828.2017.1393504",
      "DOI": "10.1080/09544828.2017.1393504",
      "Abstract": "This research aims to understand the significance of biological-analogies in fostering novelty by comparing biological-analogies with other design methods for idea generation. Among other design methods, brainstorming was chosen here as benchmark. Four studies were conducted to compare: (i) the levels of abstraction at which concepts were ideated using biological inspiration (represented using biocards) with that using traditional brainstorming; and (ii) the novelty of concepts produced by using these two design methods. Concepts produced in these studies were evaluated for levels of abstraction at which they were ideated, average novelty, and proportion of high-novelty concepts. Results suggest that concepts generated using biocards were ideated at higher abstraction levels than those using brainstorming, but neither were at the highest abstraction levels. The average novelty of concepts produced using biocards was found to be greater than that using brainstorming; however, no statistically significant difference was found in the proportion of high-novelty concepts. We suspect the lack of biological knowledge and cultural difference among the subjects involved in our studies as the two reasons behind the results. The results demonstrate that the design methods substantially influence the novelty of concepts generated, while indicating the need for better training in effective use of biological-analogies.",
      "APA": "Keshwani, S., Lenau, T. A., Ahmed-Kristensen, S., & Chakrabarti, A. (2017). Comparing novelty of designs from biological-inspiration with those from brainstorming. <em>Journal of Engineering Design</em>, 28(10-12), 654–680. https://doi.org/10.1080/09544828.2017.1393504"
    }
  ],
  "collaborations": [
    {
      "name": "Prof. Gaetano Cascini",
      "link": "https://mecc.polimi.it/en/research/faculty/prof-gaetano-cascini",
      "position": "Full Professor",
      "department": "Department of Mechanical Engineering, Politecnico di Milano, Milan, <strong>Italy</strong>",
      "departmentLink": "https://www.mecc.polimi.it/en/"
    },
    {
      "name": "Prof. Hernan Casakin",
      "link": "https://scholar.google.co.il/citations?user=kr7wm4QAAAAJ&hl=iw",
      "position": "Associate Professor",
      "department": "Department of Architecture, Ariel University, <strong>Israel</strong>",
      "departmentLink": "https://cris.ariel.ac.il/en/organisations/school-of-architecture-2"
    },
    {
      "name": "Prof. Santosh Jagtap",
      "link": "https://sites.google.com/view/santoshdesign/home",
      "position": "Associate Professor",
      "department": "Department of Design, <strong>IIT Guwahati</strong>, India",
      "departmentLink": "https://www.iitg.ac.in/design/"
    },
    {
      "name": "Prof. Amaresh Chakrabarti",
      "link": "https://dm.iisc.ac.in/cpdm/facultyprofile.php?name=1",
      "position": "Professor and Chair",
      "department": "Centre for Product Design and Manufacturing, <strong>IISc Bangalore</strong>",
      "departmentLink": "https://dm.iisc.ac.in/dm/"
    },
    {
      "name": "Prof. E.Z. Opiyo",
      "link": "https://scholar.google.com/citations?user=3SAp_hIAAAAJ&hl=en",
      "position": "Professor",
      "department": "St. Joseph University, Dar-es-salaam, <strong>Tanzania</strong>",
      "departmentLink": "https://www.sjuit.ac.tz/"
    },
    {
      "name": "Prof. Srinivasan Venkataraman",
      "link": "https://sites.google.com/view/srinivasan-aboutme/home",
      "position": "Assistant Professor",
      "department": "Department of Design, <strong>IIT Delhi</strong>, India",
      "departmentLink": "https://www.iitg.ac.in/design/"
    },
    {
      "name": "Prof. Torben Anker Lenau",
      "link": "https://orbit.dtu.dk/en/persons/torben-anker-lenau",
      "position": "Associate Professor",
      "department": "Technical University of Denmark, <strong>Denmark</strong>",
      "departmentLink": "https://www.dtu.dk/english"
    },
    {
      "name": "Prof. Saeema Ahmed-Kristensen",
      "link": "https://experts.exeter.ac.uk/34981-saeema-ahmedkristensen",
      "position": "Professor",
      "department": "Design Engineering and Innovation, University of Exeter, <strong>England</strong>",
      "departmentLink": "https://www.exeter.ac.uk/"
    }
  ],
  "projects": {
    "funded": [
      {
        "title": "Investigation of Design process in Informal Sectors",
        "duration": "December 2020 - December 2022",
        "amount": "307,700 Swedish Krona",
        "agency": "Swedish Research Council",
        "link": "https://www.vr.se/english.html",
        "description": "<a rel=\"noopener\" target=\"_blank\" class=\"hover:underline hover:text-leaf\" href=\"https://sites.google.com/view/santoshdesign/home\">Prof. Santosh Jagtap (IIT Guwahati)</a>, <a rel=\"noopener\" target=\"_blank\" class=\"hover:underline hover:text-leaf\" href=\"https://scholar.google.nl/citations?user=3SAp_hIAAAAJ&hl=en\">Prof. E.Z. Opiyo (Tanzania)</a>, <a rel=\"noopener\" target=\"_blank\" class=\"hover:underline hover:text-leaf\" href=\"https://scholar.google.com/citations?user=auL11d4AAAAJ&hl=en\">Prof. Andreas Larrson (Sweden)</a>"
      }
    ],
    "other": [
      {
        "title": "Support development for bioinspired design"
      },
      {
        "title": "Enabling systematic integration of LLM-based models with design methods for novel idea generation"
      },
      {
        "title": "Investigating the convergent and divergent thinking patterns under different design conditions"
      },
      {
        "title": "Investigating creative cognition in different design conditions"
      }
    ]
  }
}